#+TITLE: ob-rasm2

Adds [[https://r2wiki.readthedocs.io/en/latest/tools/rasm2/][rasm2]] to Org-Babel. Idea found [[https://vishnudevtj.github.io/notes/wrting-shellcode-in-emacs][here]].

* Installation
Cloe the repo, then add the following to your =init.el=

#+begin_src emacs-lisp
    (use-package ob-rasm2
      :load-path "/path/to/ob-rasm2/"
      :config (add-to-list 'org-src-lang-modes '("rasm2" . asm))) ;; important for C-' to work
#+end_src

* Example

#+begin_example

#+begin_src rasm2 :arch arm :bits 32
          add r3, pc, #1
          bx r3
          mov r0, #2
          svc #1
#+end_src

#+RESULTS:
: \x01\x30\x8f\xe2\x13\xff\x2f\xe1\x02\x00\xa0\xe3\x01\x00\x00\xef

#+end_example

#+begin_example

#+begin_src rasm2 :arch arm :bits 32 :disasm
01308fe2
#+end_src

#+RESULTS:
: add r3, pc, 1

#+end_example
